package models

import kotlinx.serialization.Serializable

/**
 * Тип квеста
 */
@Serializable
enum class QuestType {
    /**
     * Линейный квест: все задания идут друг за другом по порядку решения
     */
    LNR,

    /**
     * Нелинейный квест: все задания выдаются сразу, можно решать параллельно
     */
    NLN,

    /**
     * Линейно-нелинейный квест: задания идут по порядку,
     * но после выполнения одного задания, можно перейти только на одно из предложенных.
     * То есть дается сюжетный выбор и игрок необязательно сыграет все задания.
     * При этом одно и то же задание можно поставить на разные этапы.
     */
    LNL,

    /**
     * Многолинейный квест: несколько веток с заданиями.
     * Ветки выполняются параллельно, но в каждой ветке задания решаюься последовательно
     */
    MLN
}

/**
 * Квест или игра
 *
 * @param id идентификатор квеста
 * @param title название квеста
 * @param description описание квеста
 * @param type тип квеста: линейный, нелинейный, линейно-нелинейный многолинейный
 * @param organizers организаторы квеста
 */
@Serializable
data class Quest(
    val id: Long,
    val title: String,
    val description: String,
    val type: QuestType,
    val organizers: List<User>
)